Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Build-time optimizations ensure tasks like classpath scanning, configuration loading, and dependency injection are completed before startup, greatly reducing startup time. This efficient startup enables quicker responses to load changes and supports LightSwitchOps patterns for cost-effective elasticity. The reactive core minimizes blocking in I/O operations, further lowering latency and allowing handling a large number of concurrent tasks.
ja_jp: ビルド時の最適化により、クラスパススキャン、設定のロード、依存性注入などのタスクは起動前に完了し、起動時間を大幅に短縮します。この効率的な起動により、負荷の変化に迅速に対応でき、費用対効果の高い弾力性を実現するLightSwitchOpsパターンをサポートします。リアクティブコアは、I/O操作でのブロッキングを最小限に抑え、レイテンシーをさらに低減し、多数の同時タスクを処理できるようにします。

source: Build-time vs Run-time Initialization
ja_jp: ビルド時と実行時の初期化

source: Builder Example
ja_jp: ビルダーの例

source: Builder Pattern with Static Factory Methods
ja_jp: 静的ファクトリーメソッドを使用したビルダーパターン

source: Builder constructors are now private in the declaring classes, enforcing the use of the static factory method pattern throughout the SDK.
ja_jp: ビルダーコンストラクターは、宣言クラスで現在プライベートであり、SDK全体で静的ファクトリーメソッドパターンの使用を強制しています。

source: Building
ja_jp: ビルド

source: Building AOT-enhanced container images
ja_jp: AOT 強化されたコンテナーイメージのビルド

source: Building Applications with Gradle
ja_jp: Gradleによるアプリケーションのビルド

source: Building Applications with Maven
ja_jp: Mavenによるアプリケーションのビルド

source: Building My First Extension
ja_jp: 初めてのエクステンションのビルド

source: Building Native Executables
ja_jp: ネイティブ実行可能ファイルのビルド

source: Building Quarkus apps with Gradle
ja_jp: Gradleを使ってQuarkusアプリをビルドする

source: Building Quarkus apps with Quarkus Command Line Interface (CLI)
ja_jp: Quarkus コマンドラインインターフェイス (CLI) を使用した Quarkus アプリの構築

source: Building STM applications
ja_jp: STM アプリケーションの構築

source: Building Uber-Jars
ja_jp: UberJar のビルド

source: Building Web Components
ja_jp: Web コンポーネントの構築

source: Building a Native Executable
ja_jp: ネイティブ実行可能ファイルの生成

source: Building a command line application
ja_jp: コマンドラインアプリケーションの構築

source: Building a container
ja_jp: コンテナのビルド

source: Building a container image
ja_jp: コンテナーイメージのビルド

source: Building a container image is possible, using any of the 3 available `container-image` extensions:
ja_jp: コンテナーイメージのビルドは、利用可能な3つの `container-image` エクステンションのいずれかを使用して可能です。

source: Building a native executable
ja_jp: ネイティブ実行可能ファイルの構築

source: Building a native executable requires using a distribution of GraalVM. There are three distributions: Oracle GraalVM Community Edition (CE), Oracle GraalVM Enterprise Edition (EE) and Mandrel. The differences between the Oracle and Mandrel distributions are as follows:
ja_jp: ネイティブな実行可能ファイルをビルドするには、GraalVM のディストリビューションを使用する必要があります。ディストリビューションは3つあります。 Oracle GraalVM Community Edition (CE)、Oracle GraalVM Enterprise Edition (EE)、そして Mandrel です。Oracle ディストリビューションと Mandrel ディストリビューションの違いは以下の通りです。

source: Building a programmatic cache key
ja_jp: プログラムキャッシュキーの構築

source: Building and Running the Applications
ja_jp: アプリケーションのビルドと実行

source: Building and deploying
ja_jp: ビルドとデプロイ

source: Building and previewing Quarkus documentation
ja_jp: Quarkus ドキュメントのビルドおよびプレビュー

source: Building applications with Maven
ja_jp: Maven を使ったアプリケーションの構築

source: Building fully statically linked binaries enables the usage of a https://hub.docker.com/_/scratch[scratch image] containing solely the resulting native executable.
ja_jp: 完全に静的にリンクされたバイナリをビルドすることで、ビルド結果のネイティブ実行可能ファイルのみを含む https://hub.docker.com/_/scratch[スクラッチイメージ] を使用することができます。

source: Building my first extension
ja_jp: 初めてのエクステンションの作成

source: Building native executables is an expensive process, so make sure the container runtime has enough CPU and memory to do this. A minimum of 4 CPUs and 4GB of memory is required.
ja_jp: ネイティブ実行可能ファイルのビルドはコストのかかるプロセスであるため、コンテナーランタイムに十分な CPU とメモリーがあることを確認してください。最低でも 4 つの CPU と 4GB のメモリーが必要です。

source: Building native executables is not only time consuming, but it also takes a fair amount of memory. For example, building a sample native Quarkus JPA application such as the Hibernate quickstart, may use 6GB to 8GB resident set size in memory. A big chunk of this memory is Java heap, but extra memory is required for other aspects of the JVM that runs the native building process. It is still possible to build such applications in environments that have total memory close to the limits, but to do that it is necessary to shrink the maximum heap size of the GraalVM native image process. To do that, set a maximum heap size using the `quarkus.native.native-image-xmx` property. For example, we can instruct GraalVM to use 5GB of maximum heap size by passing in `-Dquarkus.native.native-image-xmx=5g` in the command line.
ja_jp: ネイティブ実行可能ファイルのビルドは時間がかかるだけでなく、かなりの量のメモリーも必要とします。たとえば、Hibernate クイックスタートなどのサンプルのネイティブ Quarkus JPA アプリケーションをビルドすると、メモリー内に 6GB から 8GB の常駐セットサイズが使用される場合があります。このメモリーの大部分は Java ヒープですが、ネイティブビルドプロセスを実行する JVM の他の側面には追加のメモリーが必要です。合計メモリーが限界に近い環境でこのようなアプリケーションを構築することは可能ですが、そのためには GraalVM ネイティブイメージプロセスの最大ヒープサイズを縮小する必要があります。これを行うには、 `quarkus.native.native-image-xmx` プロパティーを使用して最大ヒープサイズを設定します。たとえば、コマンドラインで `-Dquarkus.native.native-image-xmx=5g` を渡すことで、GraalVM に 5GB の最大ヒープサイズを使用するように指示できます。

source: Building native executables is not only time consuming, but it also takes a fair amount of memory. For example, building a sample native Quarkus Jakarta Persistence application such as the Hibernate ORM quickstart, may use 6GB to 8GB resident set size in memory. A big chunk of this memory is Java heap, but extra memory is required for other aspects of the JVM that runs the native building process. It is still possible to build such applications in environments that have total memory close to the limits, but to do that it is necessary to shrink the maximum heap size of the GraalVM native image process. To do that, set a maximum heap size using the `quarkus.native.native-image-xmx` property. For example, we can instruct GraalVM to use 5GB of maximum heap size by passing in `-Dquarkus.native.native-image-xmx=5g` in the command line.
ja_jp: ネイティブ実行可能ファイルの構築には時間がかかるだけでなく、かなりの量のメモリーも消費します。 たとえば、Hibernate ORM クイックスタートのようなサンプルのネイティブ Quarkus Jakarta Persistence アプリケーションを構築すると、 メモリー内で 6GB - 8GB の常駐セットサイズを使用する場合があります。 このメモリーの大部分は Java ヒープです。 ただし、ネイティブビルドプロセスを実行する JVM の他の側面には追加のメモリーが必要です。 総メモリーが限界に近い環境でも、このようなアプリケーションを構築することは可能です。 ただし、そのためには、GraalVM ネイティブイメージプロセスの最大ヒープサイズを縮小する必要があります。 これを行うには、 `quarkus.native.native-image-xmx` プロパティーを使用して最大ヒープサイズを設定します。 たとえば、GraalVM に最大 5GB のヒープサイズを使用するように指示するには、次のように渡します。 コマンドラインで `-Dquarkus.native.native-image-xmx=5g` を指定します。

source: Building native executables this way might have the side effect of requiring more time to complete. This is due to garbage collection having to work harder for native image generation to have free space to do its job.
ja_jp: この方法でネイティブ実行可能ファイルをビルドすると、完了するまでに時間がかかるという副作用が生じる可能性があります。これは、ガベージコレクションが、ネイティブイメージの生成に必要な空き領域を確保するために、より多くの作業を行う必要があるためです。

source: Building native images on Windows was broken. We added a CI check to be sure we don't break it again in the future.
ja_jp: Windows でのネイティブイメージのビルドが壊れていました。今後、二度と壊れないように、CIチェックを追加しました。

source: Building on the analysis from Step 1, the LLM then synthesizes various options, potential solutions, or different perspectives related to the query. This step demonstrates the model's ability to explore different avenues of thought before arriving at a conclusion.
ja_jp: ステップ1の分析に基づいて、LLM はクエリに関連するさまざまなオプション、潜在的な解決策、または異なる視点を統合します。このステップは、モデルが結論に達する前にさまざまな思考経路を探る能力を示しています。

source: Building on the features provided by `InjectMock`, Quarkus also allows users to effortlessly take advantage of link:https://site.mockito.org/[Mockito] for spying on the beans supported by `QuarkusMock`. This functionality is available via the `@io.quarkus.test.junit.mockito.InjectSpy` annotation which is available in the `quarkus-junit-mockito` dependency.
ja_jp: `InjectMock` が提供する機能を基に、Quarkus はユーザーが link:https://site.mockito.org/[Mockito] を簡単に利用して、`QuarkusMock` でサポートされている Bean をスパイすることも可能にします。この機能は、`quarkus-junit-mockito` 依存関係で利用可能な `@io.quarkus.test.junit.mockito.InjectSpy` アノテーションを介して利用できます。

source: Building on the features provided by `InjectMock`, Quarkus also allows users to effortlessly take advantage of link:https://site.mockito.org/[Mockito] for spying on the beans supported by `QuarkusMock`. This functionality is available via the `@io.quarkus.test.junit.mockito.InjectSpy` annotation which is available in the `quarkus-junit5-mockito` dependency.
ja_jp: `InjectMock` で提供されている機能をベースに、 `QuarkusMock` でサポートされているBeanをスパイするために link:https://site.mockito.org/[Mockito ]を簡単に利用できるようにしました。この機能は、 `quarkus-junit5-mockito` 依存関係で利用可能な `@io.quarkus.test.junit.mockito.InjectSpy` アノテーションを介して利用できます。

source: Building on the features provided by `QuarkusMock`, Quarkus also allows users to effortlessly take advantage of link:https://site.mockito.org/[Mockito] for mocking the beans supported by `QuarkusMock`.
ja_jp: `QuarkusMock` が提供する機能を基に構築されている Quarkus では、ユーザーが link:https://site.mockito.org/[Mockito] を簡単に利用して、 `QuarkusMock` でサポートされている Bean をモックすることもできます。

source: Building on the features provided by `QuarkusMock`, Quarkus also allows users to effortlessly take advantage of link:https://site.mockito.org/[Mockito] for mocking the beans supported by `QuarkusMock`. This functionality is available via the `@io.quarkus.test.junit.mockito.InjectMock` annotation which is available in the `quarkus-junit5-mockito` dependency.
ja_jp: `QuarkusMock` で提供されている機能をベースに、Quarkusでは、 `QuarkusMock` でサポートされているBeanをモックするために link:https://site.mockito.org/[Mockito ] を簡単に利用できるようにしています。この機能は、 `quarkus-junit5-mockito` 依存関係で利用可能な `@io.quarkus.test.junit.mockito.InjectMock` アノテーションを介して利用できます。

source: Building several artifacts from a single module
ja_jp: 1つのモジュールから複数のアーティファクトの作成

source: Building the application manually
ja_jp: アプリケーションを手動でビルドする

source: Building the application via gcloud
ja_jp: gcloud 経由でアプリケーションをビルドする

source: Building the application via the Google Cloud Maven plugin
ja_jp: Google Cloud Mavenプラグインを介したアプリケーションのビルド

source: Building the compressed native executable
ja_jp: 圧縮されたネイティブ実行可能ファイルのビルド

source: Building with GraalVM instead of Mandrel requires a custom builder image parameter to be passed additionally:
ja_jp: Mandrel の代わりに GraalVM を使用してビルドする場合は、カスタムビルダーイメージパラメーターを追加で渡す必要があります。

source: Building with Mandrel requires a custom builder image parameter to be passed additionally:
ja_jp: Mandrel を使用してビルドするには、カスタムビルダーイメージパラメーターを追加で渡す必要があります:

source: Building with a specific configuration profile
ja_jp: 特定の設定プロファイルでビルド

source: Building your application
ja_jp: アプリケーションのビルド

source: Buildpack Options
ja_jp: Buildpack オプション

source: Builds a response containing the caller's name, the `isSecure()` and `getAuthenticationScheme()` states of the request `SecurityContext`, and whether a non-null `JsonWebToken` was injected.
ja_jp: 呼び出し元の名前、リクエスト `SecurityContext` の `isSecure()` および `getAuthenticationScheme()` の状態、および null 以外の `JsonWebToken` が挿入されたかどうかを含む応答を構築します。

source: Builds and returns a `Map` containing all the properties required to configure the application to use in-memory channels.
ja_jp: in-memory チャネルを使用するためのアプリケーション設定に必要なすべてのプロパティーを含む `Map` をビルドして返します。

source: Builds the application with `aot-jar` packaging.
ja_jp: `aot-jar` パッケージングでアプリケーションをビルドします。

source: Build‑time data that is already exposed to the xref:dev-ui.adoc#optional-build-time-data[Dev UI] can also be made available to Dev MCP. Provide a description when calling `addBuildTimeData()`:
ja_jp: xref:dev-ui.adoc#optional-build-time-data[Dev UI] にすでに公開されているビルド時データは、Dev MCP でも利用可能にできます。`addBuildTimeData()` を呼び出すときに説明を指定してください。

source: Built on a robust reactive core, Quarkus ensures fast and efficient performance, supporting the development of a wide variety of modern applications.
ja_jp: 堅牢なリアクティブ・コア上に構築されたQuarkusは、高速で効率的なパフォーマンスを保証し、さまざまな最新アプリケーションの開発をサポートします。

source: Built-In Authentication Support
ja_jp: ビルトイン認証サポート

source: Built-in
ja_jp: 組み込み

source: Built-in Quarkus features available in Eclipse Che incl. che.openshift.io.
ja_jp: Eclipse Cheで利用可能なQuarkusの組込機能にはche.openshift.ioなどがあります。

source: Built-in Quarkus features available only in IntelliJ IDEA Ultimate
ja_jp: IntelliJ IDEA Ultimateでのみ利用可能な組込のQuarkusサポート

source: Built-in Quarkus features available only in IntelliJ Ultimate
ja_jp: IntelliJ Ultimateでのみ利用可能な組込のQuarkus機能

source: Built-in Resolvers
ja_jp: 組込リゾルバ

source: Built-in Template Extensions
ja_jp: 組み込みテンプレートエクステンション

source: Built-in UPX compression
ja_jp: 組込UPX圧縮

source: Built-in authentication mechanisms
ja_jp: 組込認証メカニズム

source: Built-in policy
ja_jp: 組込ポリシー

source: Built-in route order values
ja_jp: 組み込みのルート・オーダー値

source: Built-in section
ja_jp: 組み込みセクション

source: Built-in support for Consul and Kubernetes
ja_jp: ConsulとKubernetesの組込サポート

source: Built-in support for Maps
ja_jp: Map の組込サポート

source: Bump GraalVM minimum version to 22.2.0
ja_jp: GraalVMの最小バージョンを22.2.0に更新

source: Bump to Vert.x 4.3.2 and Netty 4.1.78
ja_jp: Vert.x 4.3.2とNetty 4.1.78にバージョンアップ

source: Bundle Name and Message Keys
ja_jp: バンドル名とメッセージキー

source: Bundling scripts, styles, and libraries
ja_jp: スクリプト、スタイル、ライブラリーのバンドル

source: Business Automation
ja_jp: ビジネスオートメーション

source: Business automation integrations
ja_jp: ビジネスオートメーション統合

source: Business method interceptors: `@AroundInvoke`
ja_jp: ビジネスメソッドインターセプタ―: `@AroundInvoke`

source: Business process
ja_jp: ビジネスプロセス

source: Business rule
ja_jp: ビジネスルール

source: But Quarkus Java based operators exist too - like the Keycloak operator - so what? Are we forced to implement a CEL policy validation engine in Java, from scratch? Or should we find a suitable Java library, for example https://github.com/projectnessie/cel-java?
ja_jp: しかし、Keycloak オペレーターのように Java ベースの Quarkus オペレーターも存在します。ではどうすればよいでしょうか。Java で CEL ポリシー検証エンジンを一から実装しなければならないのでしょうか。それとも、 https://github.com/projectnessie/cel-java などの適切な Java ライブラリーを探すべきでしょうか。

source: But after we'd started publishing the first set of results, we were approached by people who used Spring Boot every day. They link:https://github.com/quarkusio/spring-quarkus-perf-comparison/issues/108[pointed out that there were differences] in how the two frameworks handled open-session-in-view settings, and connection pool sizes. These differences were significant enough that we started to evaluate whether comparing the out-of-the-box behaviour actually _was_ the fairest option. It turns out that open-session-in-view settings and fixing the N+1 problem didn't make much difference to the numbers, but adjusting connection pool sizes did. In its default configuration, the Spring application was suffering from serious connection errors. If the client can't connect, there's no throughput, so the errors were lowering throughput. Eric, Francesco, and Sanne Grinovero spent a lot of time digging into the logs and profiling to work out configuration tweaks to ensure the Spring application could handle the load without errors.
ja_jp: しかし、最初の結果を公開し始めてから、Spring Boot を日常的に使用している人々から連絡がありました。彼らは、link:https://github.com/quarkusio/spring-quarkus-perf-comparison/issues/108[両フレームワークが open-session-in-view 設定と接続プールサイズの処理において違いがある] と指摘しました。これらの違いは十分に大きく、初期設定の動作を比較することが、実際に _最も公平な選択肢であったか_ どうかを評価し始めました。open-session-in-view 設定と N+1 問題の修正は数値に大きな違いをもたらしませんでしたが、接続プールサイズの調整は違いをもたらしました。デフォルト設定では、Spring アプリケーションは深刻な接続エラーに悩まされていました。クライアントが接続できない場合、スループットはゼロになるため、エラーがスループットを低下させていました。Eric、Francesco、Sanne Grinovero は、Spring アプリケーションがエラーなしで負荷を処理できるように、ログを詳細に調査し、プロファイリングを行って設定の微調整を見つけ出すために多くの時間を費やしました。

source: But before we do that let's add one additional feature, let's create a Homebrew formula that will make it easy for macOS users to consume the binary distribution, shall we?
ja_jp: しかし、その前に、もう 1 つの機能を追加して、macOS ユーザーがバイナリーディストリビューションを簡単に利用できるようにする Homebrew 式を作成しましょう。

source: But despite the importance of performance, our performance charts had a few problems. Firstly, the numbers are out of date. How out of date? Well, it's hard to say, because there's no date on the chart. In fact, there's no information at all about how the numbers were measured, and no link to the benchmark source code. This means no one can reproduce it, which means no one can validate. If it's not reproducible, it's not trustworthy.
ja_jp: しかし、パフォーマンスの重要性にもかかわらず、私たちのパフォーマンスチャートにはいくつかの問題がありました。第一に、数字が古いです。どれくらい古いか？それは、チャートに日付がないため、判断が難しいです。実際、その数字がどのように測定されたかについての情報は一切なく、ベンチマークのソースコードへのリンクもありません。これは、誰も再現できないことを意味し、誰も検証できないことを意味します。再現できなければ、信頼できません。

source: But forking and maintaining a fork forever is definitely not something we should consider if we can avoid it. Especially since we want to continue benefiting from all the future improvements of the GitHub API.
ja_jp: しかし、フォークして永遠に維持することは、避けられるのであれば絶対に考えるべきことではありません。特に、GitHub API の将来の改良の恩恵を受け続けたいのですから。

source: But if you already have all the required `quarkus-oidc` properties configured then you only need to associate `quarkus.oidc.auth-server-url` with the `prod` profile for `Dev Services for Keycloak`to start a container, for example:
ja_jp: ただし、必要なすべての `quarkus-oidc` プロパティーがすでに設定されている場合は、 `quarkus.oidc.auth-server-url` を `Dev Services for Keycloak` の `prod` プロファイルに関連付けるだけでコンテナーを起動できます。以下に例を示します。

source: But if you can't use it, you can start a MongoDB database using one of the two `QuarkusTestResourceLifecycleManager` that Quarkus provides. They rely on link:https://github.com/flapdoodle-oss/de.flapdoodle.embed.mongo[Flapdoodle embedded MongoDB].
ja_jp: しかし、それを使用できない場合は、Quarkus が提供する 2 つの `QuarkusTestResourceLifecycleManager` のいずれかを使用して MongoDB データベースを開始できます。 彼らは link:https://github.com/flapdoodle-oss/de.flapdoodle.embed.mongo[Flapdoodle embedded MongoDB] に依存しています。

source: But it also comes with many other enhancements be it for Micrometer, for jbang or for our Spring compatibility layer.
ja_jp: そして、Micrometer、jbang、スプリング互換性レイヤーなどに対しても、他にも多くの機能強化が施されています。

source: But it still comes with a lot of documentation improvements, fixes and enhancements, most notably:
ja_jp: しかし、それでも多くのドキュメントの改善、修正、拡張が施されています。

source: But magic is not inherently bad. Magic is power that can be used for good or for bad. After all, your application runs on a silicon with microcode magic powering an Operating System with abstraction magic powering the Java Virtual Machine with Just In Time magic. There is magic, it's just magic you have enough knowledge (or trust) of vs magic you don't.
ja_jp: しかし、マジックは本質的に悪いものではありません。マジックは良いことにも悪いことにも使えるパワーなのです。結局のところ、あなたのアプリケーションは、マイクロコードで力を与えられた半導体上で実行される、抽象化のマジックで力を与えられたオペレーティングシステム上の、JITのマジックで力を与えられたJava仮想マシンで動いています。マジックはありますが、それはあなたが十分な知識を持っている(または信頼している)マジックと、そうでないマジックのことです。

source: But otherwise you can still make your entity extend `PanacheEntity` or any of its variants, and you still get your repository injectable, or via the `Cat_.repo()` accessor.
ja_jp: しかし、それ以外の場合でも、エンティティを `PanacheEntity` またはそのバリアントのいずれかを拡張させることができ、リポジトリを注入したり、`Cat_.repo()` アクセサーを介して取得したりすることができます。

source: But please remember, all or some of these OIDC endpoint specific URLs may be discoverable when your provider supports the metadata discovery.
ja_jp: ただし、プロバイダーがメタデータ検出をサポートしている場合、これらの OIDC エンドポイント固有の URL のすべてまたは一部が検出可能である可能性があることを忘れないでください。

source: But sometimes, improving developer experience means going back to the basics: build times.
ja_jp: しかし、開発者エクスペリエンスを向上させることは、時には基本に立ち返ることを意味します。つまり、ビルド時間です。

source: But that is not all: Quarkus 3.0 introduces an update tool that can help you update your projects to Quarkus 3.
ja_jp: しかし、それで全てではありません: Quarkus 3.0では、プロジェクトをQuarkus 3に更新するためのアップデートツールが導入されています。

source: But that's mostly it. Everything else stays the same, in particular for queries and how to obtain entities.
ja_jp: しかし、ほとんどそれだけです。特にクエリーやエンティティーの取得方法については、それ以外のすべては同じままです。

source: But the best help came from outside the Quarkus community. Our intention with the benchmark was to replicate the experience of a normal user, not to tune each framework to within an inch of its life. (There's link:https://www.techempower.com/benchmarks/#section=data-r23[TechEmpower] for that.) Measuring the "out of the box" performance seemed like the best route, partly because the sort of performance most people will experience by default, and also because it was most fair. Fairness was a strong goal, because otherwise, what's the point in comparing? Our team have the skills to tune Quarkus applications to razor-sharp performance, but most of us don't have those same skills for Spring. It's just not in our job description. Tuning Quarkus but not Spring would clearly _not_ be fair.
ja_jp: しかし、最も大きな助けはQuarkusコミュニティの外から来ました。ベンチマークの意図は、通常のユーザーの体験を再現することであり、各フレームワークを極限までチューニングすることではありませんでした。（そのためには link:https://www.techempower.com/benchmarks/#section=data-r23[TechEmpower] があります。）「初期設定（out of the box）」のパフォーマンスを測定することが最善の道だと考えました。その理由の一つは、ほとんどの人がデフォルトで経験するパフォーマンスだからであり、もう一つはそれが最も公平だったからです。公平性は重要な目標でした。そうでなければ、比較する意味がありません。私たちのチームはQuarkusアプリケーションを非常に鋭いパフォーマンスにチューニングするスキルを持っていますが、私たちのほとんどはSpringに対して同じスキルを持っていません。それは私たちの職務記述書にはないのです。QuarkusだけをチューニングしてSpringをチューニングしないのは明らかに公平 _ではない_ でしょう。

source: But the point here was to do with the constraints of the user and it wasn't an option to adapt the external dependency.
ja_jp: しかし、ここでのポイントはユーザーの制約であり、外部依存を調整するという選択肢はありませんでした。

source: But the whole point of this blog post was to demonstrate that you can easily leverage our extension framework to solve real-life issues. And **in ~10 minutes of coding, our problem is gone**.
ja_jp: しかし、このブログ記事の目的は、現実の問題を解決するために、私たちのエクステンションフレームワークを簡単に利用できることを示すことでした。そして、 **10分ほどのコーディングで、私たちの問題は解決しました** 。

source: But there are definitely some questions around sizing a build infrastructure if we had wanted to increase the number of Quarkus applications developed internally.
ja_jp: しかし、社内で開発するQuarkusアプリケーションの数を増やしたいと考えた場合、ビルドインフラのサイズには疑問が残ります。

source: But there's one problem. Quarkus can't detect the programmatic lookup performed via the `CDI.current()` static method. Therefore, it is possible that a certain bean removal results in a false positive error, i.e. a bean is removed although it's actually used. In such cases, you'll notice a big warning in the log. Of course, users and extension authors have several options how to eliminate these errors. For users, the easiest way is to add a special annotation: `@io.quarkus.arc.Unremovable` or use the `quarkus.arc.unremovable-types` config property. Finally, it's also possible to disable this optimization via the `quarkus.arc.remove-unused-beans=false` config property.
ja_jp: しかし、1つ問題があります。Quarkusは、 `CDI.current()` 静的メソッドを介して実行されるプログラムによるルックアップを検出できません。そのため、あるビーンの削除で誤検出エラーが発生する可能性があります。つまり、実際に使用されているにもかかわらずビーンが削除されてしまうのです。このような場合には、ログに大きな警告が表示されます。もちろん、ユーザーやエクステンションの作者には、このようなエラーをなくす方法がいくつかあります。ユーザーにとって最も簡単な方法は、特別なアノテーション `@io.quarkus.arc.Unremovable` を追加するか、 `quarkus.arc.unremovable-types` 設定プロパティを使用することです。最後に、 `quarkus.arc.remove-unused-beans=false` の設定プロパティでこの最適化を無効にすることも可能です。

source: But these methods also accept an optional `Sort` parameter, which allows you to abstract your sorting:
ja_jp: しかし、これらのメソッドには、オプションで `Sort` というパラメータが用意されており、これによってソートの抽象化が可能になります:

source: But these methods also accept an optional `Sort` parameter, which allows your to abstract your sorting:
ja_jp: しかし、これらのメソッドはオプションで `Sort` パラメータを受け付けるので、ソートを抽象化することができます:

source: But this comes with some drawbacks:
ja_jp: しかし、これにはいくつかの欠点があります。

source: But this misconception that Quarkus must have bad throughput turns up all over the place. It keeps popping up in external blogs, and if you ask your favourite AI service about the advantages of Quarkus, it's unlikely to mention throughput. Instead, it will focus on startup time or memory. Those are important, but so is throughput.
ja_jp: しかし、Quarkusのスループットが悪いという誤解はあちこちで発生しています。外部のブログで何度も出てきますし、お気に入りのAIサービスにQuarkusの利点について尋ねても、スループットに言及する可能性は低いです。その代わりに、起動時間やメモリに焦点を当てるでしょう。それらも重要ですが、スループットも同様に重要です。
